aws/amazon-freertos/vendors/renesas/rx_driver_package/v125/r_bsp/mcu/rx72m/register_access/gnuc/iodefine.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ACTIVATE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char ACTIVATE : 1;
#endif
	} BIT;
	} FMMU2ACT;
	char           wk32[3];
	unsigned long  FMMU3LSTARTADR;
	unsigned short FMMU3LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTABIT : 3;
#endif
	} BIT;
	} FMMU3LSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTPBIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTPBIT : 3;
#endif
	} BIT;
	} FMMU3LSTOPBIT;
	unsigned short FMMU3PSTARTADR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PHYSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char PHYSTABIT : 3;
#endif
	} BIT;
	} FMMU3PSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char READ : 1;
			unsigned char WRITE : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char WRITE : 1;
			unsigned char READ : 1;
#endif
	} BIT;
	} FMMU3TYPE;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ACTIVATE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char ACTIVATE : 1;
#endif
	} BIT;
	} FMMU3ACT;
	char           wk33[3];
	unsigned long  FMMU4LSTARTADR;
	unsigned short FMMU4LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTABIT : 3;
#endif
	} BIT;
	} FMMU4LSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTPBIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTPBIT : 3;
#endif
	} BIT;
	} FMMU4LSTOPBIT;
	unsigned short FMMU4PSTARTADR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PHYSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char PHYSTABIT : 3;
#endif
	} BIT;
	} FMMU4PSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char READ : 1;
			unsigned char WRITE : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char WRITE : 1;
			unsigned char READ : 1;
#endif
	} BIT;
	} FMMU4TYPE;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ACTIVATE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char ACTIVATE : 1;
#endif
	} BIT;
	} FMMU4ACT;
	char           wk34[3];
	unsigned long  FMMU5LSTARTADR;
	unsigned short FMMU5LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTABIT : 3;
#endif
	} BIT;
	} FMMU5LSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTPBIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTPBIT : 3;
#endif
	} BIT;
	} FMMU5LSTOPBIT;
	unsigned short FMMU5PSTARTADR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PHYSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char PHYSTABIT : 3;
#endif
	} BIT;
	} FMMU5PSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char READ : 1;
			unsigned char WRITE : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char WRITE : 1;
			unsigned char READ : 1;
#endif
	} BIT;
	} FMMU5TYPE;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ACTIVATE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char ACTIVATE : 1;
#endif
	} BIT;
	} FMMU5ACT;
	char           wk35[3];
	unsigned long  FMMU6LSTARTADR;
	unsigned short FMMU6LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTABIT : 3;
#endif
	} BIT;
	} FMMU6LSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTPBIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTPBIT : 3;
#endif
	} BIT;
	} FMMU6LSTOPBIT;
	unsigned short FMMU6PSTARTADR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PHYSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char PHYSTABIT : 3;
#endif
	} BIT;
	} FMMU6PSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char READ : 1;
			unsigned char WRITE : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char WRITE : 1;
			unsigned char READ : 1;
#endif
	} BIT;
	} FMMU6TYPE;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ACTIVATE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char ACTIVATE : 1;
#endif
	} BIT;
	} FMMU6ACT;
	char           wk36[3];
	unsigned long  FMMU7LSTARTADR;
	unsigned short FMMU7LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTABIT : 3;
#endif
	} BIT;
	} FMMU7LSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char LSTPBIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char LSTPBIT : 3;
#endif
	} BIT;
	} FMMU7LSTOPBIT;
	unsigned short FMMU7PSTARTADR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char PHYSTABIT : 3;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char PHYSTABIT : 3;
#endif
	} BIT;
	} FMMU7PSTARTBIT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char READ : 1;
			unsigned char WRITE : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char WRITE : 1;
			unsigned char READ : 1;
#endif
	} BIT;
	} FMMU7TYPE;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char ACTIVATE : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char ACTIVATE : 1;
#endif
	} BIT;
	} FMMU7ACT;
	char           wk37[387];
	unsigned short SM0PSTARTADR;
	unsigned short SM0LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char OPEMODE : 2;
			unsigned char DIR : 2;
			unsigned char IRQECAT : 1;
			unsigned char IRQPDI : 1;
			unsigned char WDTRGEN : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char WDTRGEN : 1;
			unsigned char IRQPDI : 1;
			unsigned char IRQECAT : 1;
			unsigned char DIR : 2;
			unsigned char OPEMODE : 2;
#endif
	} BIT;
	} SM0CONTROL;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char INTWR : 1;
			unsigned char INTRD : 1;
			unsigned char  : 1;
			unsigned char MAILBOX : 1;
			unsigned char BUFFERED : 2;
			unsigned char RDBUF : 1;
			unsigned char WRBUF : 1;
#else
			unsigned char WRBUF : 1;
			unsigned char RDBUF : 1;
			unsigned char BUFFERED : 2;
			unsigned char MAILBOX : 1;
			unsigned char  : 1;
			unsigned char INTRD : 1;
			unsigned char INTWR : 1;
#endif
	} BIT;
	} SM0STATUS;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SMEN : 1;
			unsigned char REPEATREQ : 1;
			unsigned char  : 4;
			unsigned char LATCHECAT : 1;
			unsigned char LATCHPDI : 1;
#else
			unsigned char LATCHPDI : 1;
			unsigned char LATCHECAT : 1;
			unsigned char  : 4;
			unsigned char REPEATREQ : 1;
			unsigned char SMEN : 1;
#endif
	} BIT;
	} SM0ACT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DEACTIVE : 1;
			unsigned char REPEATACK : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char REPEATACK : 1;
			unsigned char DEACTIVE : 1;
#endif
	} BIT;
	} SM0PDICONT;
	unsigned short SM1PSTARTADR;
	unsigned short SM1LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char OPEMODE : 2;
			unsigned char DIR : 2;
			unsigned char IRQECAT : 1;
			unsigned char IRQPDI : 1;
			unsigned char WDTRGEN : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char WDTRGEN : 1;
			unsigned char IRQPDI : 1;
			unsigned char IRQECAT : 1;
			unsigned char DIR : 2;
			unsigned char OPEMODE : 2;
#endif
	} BIT;
	} SM1CONTROL;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char INTWR : 1;
			unsigned char INTRD : 1;
			unsigned char  : 1;
			unsigned char MAILBOX : 1;
			unsigned char BUFFERED : 2;
			unsigned char RDBUF : 1;
			unsigned char WRBUF : 1;
#else
			unsigned char WRBUF : 1;
			unsigned char RDBUF : 1;
			unsigned char BUFFERED : 2;
			unsigned char MAILBOX : 1;
			unsigned char  : 1;
			unsigned char INTRD : 1;
			unsigned char INTWR : 1;
#endif
	} BIT;
	} SM1STATUS;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SMEN : 1;
			unsigned char REPEATREQ : 1;
			unsigned char  : 4;
			unsigned char LATCHECAT : 1;
			unsigned char LATCHPDI : 1;
#else
			unsigned char LATCHPDI : 1;
			unsigned char LATCHECAT : 1;
			unsigned char  : 4;
			unsigned char REPEATREQ : 1;
			unsigned char SMEN : 1;
#endif
	} BIT;
	} SM1ACT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DEACTIVE : 1;
			unsigned char REPEATACK : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char REPEATACK : 1;
			unsigned char DEACTIVE : 1;
#endif
	} BIT;
	} SM1PDICONT;
	unsigned short SM2PSTARTADR;
	unsigned short SM2LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char OPEMODE : 2;
			unsigned char DIR : 2;
			unsigned char IRQECAT : 1;
			unsigned char IRQPDI : 1;
			unsigned char WDTRGEN : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char WDTRGEN : 1;
			unsigned char IRQPDI : 1;
			unsigned char IRQECAT : 1;
			unsigned char DIR : 2;
			unsigned char OPEMODE : 2;
#endif
	} BIT;
	} SM2CONTROL;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char INTWR : 1;
			unsigned char INTRD : 1;
			unsigned char  : 1;
			unsigned char MAILBOX : 1;
			unsigned char BUFFERED : 2;
			unsigned char RDBUF : 1;
			unsigned char WRBUF : 1;
#else
			unsigned char WRBUF : 1;
			unsigned char RDBUF : 1;
			unsigned char BUFFERED : 2;
			unsigned char MAILBOX : 1;
			unsigned char  : 1;
			unsigned char INTRD : 1;
			unsigned char INTWR : 1;
#endif
	} BIT;
	} SM2STATUS;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SMEN : 1;
			unsigned char REPEATREQ : 1;
			unsigned char  : 4;
			unsigned char LATCHECAT : 1;
			unsigned char LATCHPDI : 1;
#else
			unsigned char LATCHPDI : 1;
			unsigned char LATCHECAT : 1;
			unsigned char  : 4;
			unsigned char REPEATREQ : 1;
			unsigned char SMEN : 1;
#endif
	} BIT;
	} SM2ACT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DEACTIVE : 1;
			unsigned char REPEATACK : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char REPEATACK : 1;
			unsigned char DEACTIVE : 1;
#endif
	} BIT;
	} SM2PDICONT;
	unsigned short SM3PSTARTADR;
	unsigned short SM3LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char OPEMODE : 2;
			unsigned char DIR : 2;
			unsigned char IRQECAT : 1;
			unsigned char IRQPDI : 1;
			unsigned char WDTRGEN : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char WDTRGEN : 1;
			unsigned char IRQPDI : 1;
			unsigned char IRQECAT : 1;
			unsigned char DIR : 2;
			unsigned char OPEMODE : 2;
#endif
	} BIT;
	} SM3CONTROL;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char INTWR : 1;
			unsigned char INTRD : 1;
			unsigned char  : 1;
			unsigned char MAILBOX : 1;
			unsigned char BUFFERED : 2;
			unsigned char RDBUF : 1;
			unsigned char WRBUF : 1;
#else
			unsigned char WRBUF : 1;
			unsigned char RDBUF : 1;
			unsigned char BUFFERED : 2;
			unsigned char MAILBOX : 1;
			unsigned char  : 1;
			unsigned char INTRD : 1;
			unsigned char INTWR : 1;
#endif
	} BIT;
	} SM3STATUS;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SMEN : 1;
			unsigned char REPEATREQ : 1;
			unsigned char  : 4;
			unsigned char LATCHECAT : 1;
			unsigned char LATCHPDI : 1;
#else
			unsigned char LATCHPDI : 1;
			unsigned char LATCHECAT : 1;
			unsigned char  : 4;
			unsigned char REPEATREQ : 1;
			unsigned char SMEN : 1;
#endif
	} BIT;
	} SM3ACT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DEACTIVE : 1;
			unsigned char REPEATACK : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char REPEATACK : 1;
			unsigned char DEACTIVE : 1;
#endif
	} BIT;
	} SM3PDICONT;
	unsigned short SM4PSTARTADR;
	unsigned short SM4LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char OPEMODE : 2;
			unsigned char DIR : 2;
			unsigned char IRQECAT : 1;
			unsigned char IRQPDI : 1;
			unsigned char WDTRGEN : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char WDTRGEN : 1;
			unsigned char IRQPDI : 1;
			unsigned char IRQECAT : 1;
			unsigned char DIR : 2;
			unsigned char OPEMODE : 2;
#endif
	} BIT;
	} SM4CONTROL;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char INTWR : 1;
			unsigned char INTRD : 1;
			unsigned char  : 1;
			unsigned char MAILBOX : 1;
			unsigned char BUFFERED : 2;
			unsigned char RDBUF : 1;
			unsigned char WRBUF : 1;
#else
			unsigned char WRBUF : 1;
			unsigned char RDBUF : 1;
			unsigned char BUFFERED : 2;
			unsigned char MAILBOX : 1;
			unsigned char  : 1;
			unsigned char INTRD : 1;
			unsigned char INTWR : 1;
#endif
	} BIT;
	} SM4STATUS;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SMEN : 1;
			unsigned char REPEATREQ : 1;
			unsigned char  : 4;
			unsigned char LATCHECAT : 1;
			unsigned char LATCHPDI : 1;
#else
			unsigned char LATCHPDI : 1;
			unsigned char LATCHECAT : 1;
			unsigned char  : 4;
			unsigned char REPEATREQ : 1;
			unsigned char SMEN : 1;
#endif
	} BIT;
	} SM4ACT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DEACTIVE : 1;
			unsigned char REPEATACK : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char REPEATACK : 1;
			unsigned char DEACTIVE : 1;
#endif
	} BIT;
	} SM4PDICONT;
	unsigned short SM5PSTARTADR;
	unsigned short SM5LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char OPEMODE : 2;
			unsigned char DIR : 2;
			unsigned char IRQECAT : 1;
			unsigned char IRQPDI : 1;
			unsigned char WDTRGEN : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char WDTRGEN : 1;
			unsigned char IRQPDI : 1;
			unsigned char IRQECAT : 1;
			unsigned char DIR : 2;
			unsigned char OPEMODE : 2;
#endif
	} BIT;
	} SM5CONTROL;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char INTWR : 1;
			unsigned char INTRD : 1;
			unsigned char  : 1;
			unsigned char MAILBOX : 1;
			unsigned char BUFFERED : 2;
			unsigned char RDBUF : 1;
			unsigned char WRBUF : 1;
#else
			unsigned char WRBUF : 1;
			unsigned char RDBUF : 1;
			unsigned char BUFFERED : 2;
			unsigned char MAILBOX : 1;
			unsigned char  : 1;
			unsigned char INTRD : 1;
			unsigned char INTWR : 1;
#endif
	} BIT;
	} SM5STATUS;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SMEN : 1;
			unsigned char REPEATREQ : 1;
			unsigned char  : 4;
			unsigned char LATCHECAT : 1;
			unsigned char LATCHPDI : 1;
#else
			unsigned char LATCHPDI : 1;
			unsigned char LATCHECAT : 1;
			unsigned char  : 4;
			unsigned char REPEATREQ : 1;
			unsigned char SMEN : 1;
#endif
	} BIT;
	} SM5ACT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DEACTIVE : 1;
			unsigned char REPEATACK : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char REPEATACK : 1;
			unsigned char DEACTIVE : 1;
#endif
	} BIT;
	} SM5PDICONT;
	unsigned short SM6PSTARTADR;
	unsigned short SM6LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char OPEMODE : 2;
			unsigned char DIR : 2;
			unsigned char IRQECAT : 1;
			unsigned char IRQPDI : 1;
			unsigned char WDTRGEN : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char WDTRGEN : 1;
			unsigned char IRQPDI : 1;
			unsigned char IRQECAT : 1;
			unsigned char DIR : 2;
			unsigned char OPEMODE : 2;
#endif
	} BIT;
	} SM6CONTROL;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char INTWR : 1;
			unsigned char INTRD : 1;
			unsigned char  : 1;
			unsigned char MAILBOX : 1;
			unsigned char BUFFERED : 2;
			unsigned char RDBUF : 1;
			unsigned char WRBUF : 1;
#else
			unsigned char WRBUF : 1;
			unsigned char RDBUF : 1;
			unsigned char BUFFERED : 2;
			unsigned char MAILBOX : 1;
			unsigned char  : 1;
			unsigned char INTRD : 1;
			unsigned char INTWR : 1;
#endif
	} BIT;
	} SM6STATUS;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SMEN : 1;
			unsigned char REPEATREQ : 1;
			unsigned char  : 4;
			unsigned char LATCHECAT : 1;
			unsigned char LATCHPDI : 1;
#else
			unsigned char LATCHPDI : 1;
			unsigned char LATCHECAT : 1;
			unsigned char  : 4;
			unsigned char REPEATREQ : 1;
			unsigned char SMEN : 1;
#endif
	} BIT;
	} SM6ACT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DEACTIVE : 1;
			unsigned char REPEATACK : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char REPEATACK : 1;
			unsigned char DEACTIVE : 1;
#endif
	} BIT;
	} SM6PDICONT;
	unsigned short SM7PSTARTADR;
	unsigned short SM7LEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char OPEMODE : 2;
			unsigned char DIR : 2;
			unsigned char IRQECAT : 1;
			unsigned char IRQPDI : 1;
			unsigned char WDTRGEN : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char WDTRGEN : 1;
			unsigned char IRQPDI : 1;
			unsigned char IRQECAT : 1;
			unsigned char DIR : 2;
			unsigned char OPEMODE : 2;
#endif
	} BIT;
	} SM7CONTROL;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char INTWR : 1;
			unsigned char INTRD : 1;
			unsigned char  : 1;
			unsigned char MAILBOX : 1;
			unsigned char BUFFERED : 2;
			unsigned char RDBUF : 1;
			unsigned char WRBUF : 1;
#else
			unsigned char WRBUF : 1;
			unsigned char RDBUF : 1;
			unsigned char BUFFERED : 2;
			unsigned char MAILBOX : 1;
			unsigned char  : 1;
			unsigned char INTRD : 1;
			unsigned char INTWR : 1;
#endif
	} BIT;
	} SM7STATUS;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SMEN : 1;
			unsigned char REPEATREQ : 1;
			unsigned char  : 4;
			unsigned char LATCHECAT : 1;
			unsigned char LATCHPDI : 1;
#else
			unsigned char LATCHPDI : 1;
			unsigned char LATCHECAT : 1;
			unsigned char  : 4;
			unsigned char REPEATREQ : 1;
			unsigned char SMEN : 1;
#endif
	} BIT;
	} SM7ACT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char DEACTIVE : 1;
			unsigned char REPEATACK : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char REPEATACK : 1;
			unsigned char DEACTIVE : 1;
#endif
	} BIT;
	} SM7PDICONT;
	char           wk38[192];
	unsigned long  DCRCVTIMEPORT0;
	unsigned long  DCRCVTIMEPORT1;
	char           wk39[8];
	unsigned long long DCSYSTIME;
	unsigned long long DCRCVTIMEEPU;
	unsigned long long DCSYSTIMEOFFSET;
	unsigned long  DCSYSTIMEDELAY;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DIFF : 31;
			unsigned long LOCALCOPY : 1;
#else
			unsigned long LOCALCOPY : 1;
			unsigned long DIFF : 31;
#endif
	} BIT;
	} DCSYSTIMEDIFF;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short SCSTART : 15;
			unsigned short  : 1;
#else
			unsigned short  : 1;
			unsigned short SCSTART : 15;
#endif
	} BIT;
	} DCSCSTART;
	unsigned short DCSCDIFF;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FILDP : 4;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char FILDP : 4;
#endif
	} BIT;
	} DCSYSTIMEFILDP;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FILDP : 4;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char FILDP : 4;
#endif
	} BIT;
	} DCSCFILDP;
	char           wk40[74];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SYNCOUT : 1;
			unsigned char  : 3;
			unsigned char LATCH0 : 1;
			unsigned char LATCH1 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char LATCH1 : 1;
			unsigned char LATCH0 : 1;
			unsigned char  : 3;
			unsigned char SYNCOUT : 1;
#endif
	} BIT;
	} DCCYCCONT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SYNCACT : 1;
			unsigned char SYNC0 : 1;
			unsigned char SYNC1 : 1;
			unsigned char AUTOACT : 1;
			unsigned char EXTSTARTTIME : 1;
			unsigned char STARTTIME : 1;
			unsigned char NEARFUTURE : 1;
			unsigned char DBGPULSE : 1;
#else
			unsigned char DBGPULSE : 1;
			unsigned char NEARFUTURE : 1;
			unsigned char STARTTIME : 1;
			unsigned char EXTSTARTTIME : 1;
			unsigned char AUTOACT : 1;
			unsigned char SYNC1 : 1;
			unsigned char SYNC0 : 1;
			unsigned char SYNCACT : 1;
#endif
	} BIT;
	} DCACT;
	unsigned short DCPULSELEN;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SYNC0ACT : 1;
			unsigned char SYNC1ACT : 1;
			unsigned char STARTTIME : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char STARTTIME : 1;
			unsigned char SYNC1ACT : 1;
			unsigned char SYNC0ACT : 1;
#endif
	} BIT;
	} DCACTSTAT;
	char           wk41[9];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SYNC0STA : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char SYNC0STA : 1;
#endif
	} BIT;
	} DCSYNC0STAT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char SYNC1STA : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char SYNC1STA : 1;
#endif
	} BIT;
	} DCSYNC1STAT;
	unsigned long long DCCYCSTARTTIME;
	unsigned long long DCNEXTSYNC1;
	unsigned long  DCSYNC0CYCTIME;
	unsigned long  DCSYNC1CYCTIME;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POSEDGE : 1;
			unsigned char NEGEDGE : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char NEGEDGE : 1;
			unsigned char POSEDGE : 1;
#endif
	} BIT;
	} DCLATCH0CONT;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POSEDGE : 1;
			unsigned char NEGEDGE : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char NEGEDGE : 1;
			unsigned char POSEDGE : 1;
#endif
	} BIT;
	} DCLATCH1CONT;
	char           wk42[4];
	union {
		unsigned char BYTE;
		struct {
			
